Revit 2027 API
EnergyAnalysisConstruction.ThermalResistance Property
 The thermal resistance value (R-value) of the construction, in K*s^3/kg.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ThermalResistance { get; }
Public ReadOnly Property ThermalResistance As Double
	Get
public:
property double ThermalResistance {
	double get ();
}
member ThermalResistance : float with get
Property Value
Double
See Also
Reference
EnergyAnalysisConstruction Class
Autodesk.Revit.DB.Analysis Namespace